SAMS0N1TE/LakeShark/main/flipper_link.c
/* flipper_link - serial control head protocol for LakeShark. See header. */

#include "flipper_link.h"

#include <ctype.h>
#include <strings.h>
#include <stdio.h>
#include <stdlib.h>
#include <string.h>

#include "freertos/FreeRTOS.h"
#include "freertos/task.h"
#include "driver/uart.h"
#include "driver/gpio.h"
#include "esp_log.h"
#include "esp_timer.h"
#include "esp_rom_sys.h"
#include "soc/soc_caps.h"

#include "lakeshark_backend.h"
#include "audio_out.h"
#include "audio_eq.h"
#include "tone.h"

static const char *TAG = "fl_link";

#define FL_LINE_MAX    192
#define REPLY_MAX   256
#define TEL_MAX     576
#define RX_BUF_SZ   1024
#define TX_BUF_SZ   2048

static flipper_link_cfg_t s_cfg      = FLIPPER_LINK_CFG_DEFAULT();
static flipper_link_host_t s_host    = { 0 };
static TaskHandle_t       s_task     = NULL;
static volatile bool      s_run      = false;
static volatile bool      s_verbose  = false;
static volatile bool      s_installed = false;

static uint32_t s_rx_lines  = 0;
static uint32_t s_tx_lines  = 0;
static uint32_t s_bad_lines = 0;

/* Set when a command asks for an out-of-band immediate telemetry frame. */
static volatile bool s_stat_now = false;


static esp_err_t link_install(void);
static void      link_uninstall(void);

/* Which radio app is live, so commands and telemetry can follow it. */
typedef enum { HOST_MODE_P25, HOST_MODE_ADSB, HOST_MODE_FM } host_mode_t;

static host_mode_t host_mode(void)
{
    const char *n = s_host.current_mode_name ? s_host.current_mode_name() : "P25";
    if (!n) return HOST_MODE_P25;
    if (!strcasecmp(n, "FM"))    return HOST_MODE_FM;
    if (!strcasecmp(n, "ADS-B")) return HOST_MODE_ADSB;
    if (!strcasecmp(n, "ADSB"))  return HOST_MODE_ADSB;
    return HOST_MODE_P25;
}

/* ------------------------------------------------------------------ utils */

static void str_upper(char *s)
{
    for (; *s; s++) *s = (char)toupper((unsigned char)*s);
}

/* Split `line` in place into at most `max` whitespace-delimited tokens. */
static int tokenize(char *line, char **argv, int max)
{
    int argc = 0;
    char *p = line;
    while (*p && argc < max) {
        while (*p == ' ' || *p == '\t') p++;
        if (!*p) break;
        argv[argc++] = p;
        while (*p && *p != ' ' && *p != '\t') p++;
        if (*p) *p++ = '\0';
    }
    return argc;
}

/* dsd_err_str and friends can contain spaces, which would break the
 * key=value telemetry framing. Squash them. */
static void sanitize(char *s)
{
    for (; *s; s++) {
        if (*s == ' ' || *s == '\t' || *s == '=' || *s == '\r' || *s == '\n') *s = '_';
    }
}

static bool parse_i32(const char *s, int32_t *out)
{
    if (!s || !*s) return false;
    char *end = NULL;
    long v = strtol(s, &end, 0);
    if (end == s) return false;
    while (*end == ' ') end++;
    if (*end) return false;
    *out = (int32_t)v;
    return true;
}

/* Accepts "851.0125" (MHz), "851012500" (Hz) or "851012.5" (kHz-ish). We treat
 * anything under 10000 as MHz and anything else as Hz, which covers every
 * sensible P25 entry without needing a unit suffix. */
static bool parse_freq_hz(const char *s, uint32_t *out)
{
    if (!s || !*s) return false;
    char *end = NULL;
    double v = strtod(s, &end);
    if (end == s || v <= 0) return false;
    if (v < 10000.0) v *= 1e6;          /* MHz */
    if (v < 1e6 || v > 2.0e9) return false;
    *out = (uint32_t)(v + 0.5);
    return true;
}

/* ------------------------------------------------------------- telemetry */

/* How long the dongle has been claiming to be ready while delivering nothing.
 *
 * The failure this exists for: nudge the P4 and the RTL-SDR's USB connection
 * drops out from under the host stack. `rtl` still reads 1 - the device handle
 * is open - but no transfers are posted and `bps` sits at 0 for ever. The log
 * says `USB HOST: Get EP handle error: ESP_ERR_NOT_FOUND` once and then nothing.
 * From the head it looks exactly like a quiet band, which is why it went
 * unnoticed until someone power-cycled the board.
 *
 * Two failures look identical from the head and are worth telling apart,
 * because they need different recoveries. Both were seen on hardware:
 *
 *   - The SoC ran out of internal RAM (an app switch could not get its task
 *     stack). REBOOT fixes this, because the heap is rebuilt from scratch.
 *   - The dongle's USB connection was physically disturbed. REBOOT does NOT fix
 *     this - it is the dongle that needs reinitialising, and it survives an SoC
 *     reset - so only `SDR power`, which drops its VBUS, recovers it.
 *
 * This counter only reports the second class: it requires the device to claim
 * readiness, which a crashed or rebooting SoC does not.
 *
 * Each builder records the byte rate it just reported, and this turns a run of
 * zeroes into a number the head can put on screen. */
static uint32_t s_last_bps = 0;
static int64_t  s_bps_ok_us = 0;

/* Set once the dongle has actually delivered samples in the current mode.
 *
 * Without this, a mode that has never streamed reads as "stalled" from the
 * moment it is entered, which is not the same thing at all and must not trigger
 * recovery: ADS-B currently reports rtl=1 with bps=0 indefinitely, so an
 * unguarded detector would sit there recovering a receiver that was never
 * running. Only a receiver that WAS working and then stopped is a stall. */
static bool s_bps_seen = false;

static int sdr_stall_s(void)
{
    int64_t now = esp_timer_get_time();

    if (!lakeshark_radio_device_ready()) {
        /* Not claiming to be ready, so "stalled" is not the right word for it -
         * the head shows "no SDR" from the rtl key instead. */
        s_bps_ok_us = now;
        return 0;
    }
    if (s_last_bps > 0) {
        s_bps_ok_us = now;
        s_bps_seen  = true;
        return 0;
    }
    if (!s_bps_seen || s_bps_ok_us == 0) {
        s_bps_ok_us = now;
        return 0;
    }
    return (int)((now - s_bps_ok_us) / 1000000LL);
}

/* Called when the app changes: the new app has not streamed yet, and carrying
 * the previous one's "it was working" over to it is how a healthy mode switch
 * gets mistaken for a stall. */
static void sdr_stall_reset(void)
{
    s_bps_seen  = false;
    s_last_bps  = 0;
    s_bps_ok_us = esp_timer_get_time();
}

/* Health keys for the head's Device page: uptime seconds, free internal and
 * free DMA-capable bytes. Internal/DMA RAM is the scarce resource on this board
 * and the failures when it runs out are indirect (an SDIO assert, a task stack
 * silently landing in PSRAM), so it is worth a permanent readout rather than a
 * command you have to remember to run.
 *
 * Emitted at 1 Hz, not on every frame. They change slowly, and on BLE the frame
 * length is not free: the ACL buffer is malloc'd from the internal heap by the
 * VHCI transport, and a failed allocation there is a hard assert that reboots
 * the radio (see ble_write()). Adding ~25 bytes to all five frames a second is
 * exactly the kind of pressure worth not adding. The head carries the last
 * values forward across frames that omit them.
 *
 * Appended by build_telemetry(), which is also what terminates the line - the
 * per-mode builders below deliberately do not emit the newline themselves. */
static int append_sys(char *buf, size_t len, int n)
{
    static int64_t last_us = 0;

    if (n < 0 || (size_t)n >= len - 1) return n;

    int stall = sdr_stall_s();

    int64_t now = esp_timer_get_time();
    /* The stall counter is the exception to the 1 Hz rule: once the dongle has
     * gone quiet the head should say so on the next frame, not up to a second
     * later, because "is it a quiet band or is my radio dead" is exactly the
     * question this answers. */
    bool due = !last_us || (now - last_us >= 1000000LL);
    if (!due && stall == 0) return n;
    if (due) last_us = now;

    uint32_t up = s_host.uptime_s ? s_host.uptime_s() : 0;
    uint32_t fi = 0, fd = 0, fp = 0;
    if (s_host.heap_stats) s_host.heap_stats(&fi, &fd, &fp);

    int w = snprintf(buf + n, len - (size_t)n, " up=%lu fi=%lu fd=%lu stl=%d",
                     (unsigned long)up, (unsigned long)fi, (unsigned long)fd, stall);
    if (w < 0 || (size_t)(n + w) >= len - 1) return n;
    return n + w;
}

