SAMS0N1TE/LakeShark/main/flipper_link.c
int flipper_link_eq_snapshot(char *buf, size_t len)
{
    if (!buf || len < 8) return 0;

    audio_eq_cfg_t eq;
    audio_eq_get(&eq);

    int n = snprintf(buf, len, "& eq=%d eh=%d eb=%d et=%d ep=%d el=%d egr=%d\n",
                     eq.preset, eq.hp10 * 10, eq.bass_db, eq.treb_db,
                     eq.punch, eq.loud, audio_eq_gr_db10());
    if (n < 0) return 0;
    if ((size_t)n >= len) n = (int)len - 1;
    return n;
}

/* FM frame. Same "$ " framing and the same common keys (f/g/v/mu/rtl/iq/re/bps/
 * md) as the P25 one, so the head's parser needs no special case - it just sees
 * md=FM and the fm* keys appear. */
static int build_telemetry_fm(char *buf, size_t len)
{
    static const char *sub[] = { "listen", "scan", "pocsag", "wfm" };

    lakeshark_fm_tel_t t;
    lakeshark_fm_telemetry(&t);
    s_last_bps = t.iq_bytes_sec;

    char text[80];
    strlcpy(text, t.pocsag_last_text[0] ? t.pocsag_last_text : "-", sizeof(text));
    sanitize(text);

    char ptype[2] = { t.pocsag_last_type ? t.pocsag_last_type : '-', 0 };

    return snprintf(buf, len,
        "$ f=%lu g=%d v=%d mu=%d iq=%d rtl=%d re=%d bps=%lu md=FM "
        "fm=%s sq=%d so=%d au=%d "
        "ss=%lu se=%lu spk=%lu sdb=%d sw=%lu "
        "pb=%d pau=%d psy=%d pp=%lu pf=%lu pa=%lu pbd=%d pty=%s ptx=%s",
        (unsigned long)t.freq_hz, t.gain_tenths,
        audio_volume_get(), audio_is_muted() ? 1 : 0,
        t.iq_level, lakeshark_radio_device_ready() ? 1 : 0, t.read_errors,
        (unsigned long)t.iq_bytes_sec,
        sub[t.submode & 3], t.squelch_tenths, t.squelch_open, t.audio_level,
        (unsigned long)t.scan_start_hz, (unsigned long)t.scan_stop_hz,
        (unsigned long)t.scan_peak_hz, t.scan_peak_db,
        (unsigned long)t.scan_sweeps,
        t.pocsag_baud, t.pocsag_auto, t.pocsag_sync,
        (unsigned long)t.pocsag_pages, (unsigned long)t.pocsag_frames,
        (unsigned long)t.pocsag_last_addr, t.pocsag_last_baud, ptype, text);
}

/* ADS-B frame. Same "$ " framing and common keys as the others, plus md=ADSB.
 *
 * There was no ADS-B frame at all before: build_telemetry() fell through to the
 * P25 branch, so a head in ADS-B mode was shown a frozen P25 talkgroup and a
 * dead S-meter under an "ADS-B" label. That is a large part of why the on-screen
 * detail "does not work most of the time".
 *
 * The tracked table can hold 16 aircraft and a full dump would not fit in
 * TEL_MAX, so each frame carries a window of AC_PER_FRAME entries starting at
 * `aci`, and the window advances every frame. At 5 Hz the whole table refreshes
 * in under a second, and the head reassembles it by slot rather than having to
 * ask for more. */
#define AC_PER_FRAME 4

static int build_telemetry_adsb(char *buf, size_t len)
{
    static int s_ac_cursor = 0;

    lakeshark_adsb_tel_t t;
    lakeshark_adsb_telemetry(&t);
    s_last_bps = t.iq_bytes_sec;

    if (t.n_aircraft <= 0) s_ac_cursor = 0;
    else if (s_ac_cursor >= t.n_aircraft) s_ac_cursor = 0;

    int n = snprintf(buf, len,
        "$ f=%lu g=%d v=%d mu=%d rtl=%d bps=%lu md=ADSB "
        "ac=%d mt=%d mps=%d cg=%d ce=%d bps1=%d mga=%d mgp=%d lms=%d "
        "aci=%d acn=%d",
        (unsigned long)t.freq_hz, t.gain_tenths,
        audio_volume_get(), audio_is_muted() ? 1 : 0,
        t.rtl_ready, (unsigned long)t.iq_bytes_sec,
        t.tracked, t.msgs_total, t.msgs_sec, t.crc_good, t.crc_err,
        t.bursts_sec, t.mag_avg, t.mag_peak, t.last_msg_ms,
        s_ac_cursor, t.n_aircraft);
    if (n < 0) return n;

    /* One token per aircraft: a<slot>=ICAO,CALL,ALT,SPD,HDG,VS,AGEms,MSGS
     * Callsign is sanitised like every other string field, and '-' stands in for
     * one that has not been decoded yet. */
    /* One record at a time: a whole table of these on this task's stack is what
     * overflowed it (see lakeshark_adsb_telemetry's header comment). */
    for (int k = 0; k < AC_PER_FRAME && (size_t)n < len - 1; k++) {
        int idx = s_ac_cursor + k;
        if (idx >= t.n_aircraft) break;

        lakeshark_adsb_ac_t a;
        if (!lakeshark_adsb_aircraft_at(idx, &a)) break;

        char call[12];
        strlcpy(call, a.callsign[0] ? a.callsign : "-", sizeof(call));
        sanitize(call);

        int w = snprintf(buf + n, len - (size_t)n,
                         " a%d=%06lX,%s,%d,%d,%d,%d,%d,%d",
                         idx, (unsigned long)a.icao, call,
                         a.altitude, a.velocity, a.heading, a.vert_rate,
                         a.age_ms, a.msg_count);
        if (w < 0 || (size_t)(n + w) >= len - 1) break;
        n += w;
    }

    s_ac_cursor += AC_PER_FRAME;
    if (s_ac_cursor >= t.n_aircraft) s_ac_cursor = 0;

    return n;
}

static int build_telemetry_p25(char *buf, size_t len)
{

    lakeshark_p25_tel_t t;
    lakeshark_p25_telemetry(&t);
    s_last_bps = t.iq_bytes_sec;

    char ftype[16];
    char err[64];
    strlcpy(ftype, t.ftype[0] ? t.ftype : "-", sizeof(ftype));
    strlcpy(err,   t.err[0]   ? t.err   : "-", sizeof(err));
    sanitize(ftype);
    sanitize(err);

    const char *mode = (s_host.current_mode_name ? s_host.current_mode_name() : "P25");

    return snprintf(buf, len,
        "$ f=%lu dm=%d dmn=%s g=%d agc=%d v=%d mu=%d "
        "nac=%d tg=%d src=%d na=%d ta=%d sa=%d sy=%d vo=%d sc=%d vc=%d bo=%d bf=%d "
        "iq=%d pol=%d bp=%d vg=%d rtl=%d rf=%d rs=%d re=%d "
        "bps=%lu ad=%lu dus=%d md=%s ft=%s e=%s",
        (unsigned long)t.freq_hz, t.demod_mode, lakeshark_p25_mode_name(),
        t.gain_tenths, t.agc_on, audio_volume_get(), audio_is_muted() ? 1 : 0,
        t.nac, t.tg, t.src,
        t.nac_age_ms, t.tg_age_ms, t.src_age_ms,
        t.has_sync, t.voice_active,
        t.sync_count, t.voice_count, t.bch_ok, t.bch_fail,
        t.iq_level, t.polarity_inverted, t.beep, t.voice_gate, t.rtl_ready,
        t.ring_fill, t.ring_size, t.read_errors,
        (unsigned long)t.iq_bytes_sec, (unsigned long)t.audio_drops, t.decode_us,
        mode, ftype, err);
}

/* Dispatch to the live app's builder, append the common health keys, terminate.
 * Owning the newline here is what lets append_sys() add to any frame. */
static int build_telemetry(char *buf, size_t len)
{
    int n;
    switch (host_mode()) {
    case HOST_MODE_FM:   n = build_telemetry_fm(buf, len);   break;
    case HOST_MODE_ADSB: n = build_telemetry_adsb(buf, len); break;
    default:             n = build_telemetry_p25(buf, len);  break;
    }
    if (n < 0) return n;
    /* snprintf reports what it *would* have written, not what it did, so a
     * truncated frame would otherwise index past the buffer here. */
    if ((size_t)n >= len - 2) n = (int)len - 2;

    n = append_sys(buf, len, n);

    buf[n++] = '\n';
    buf[n]   = '\0';
    return n;
}

/* --------------------------------------------------------- command table */

static void eq_reply(char *reply, size_t reply_len)
{
    audio_eq_cfg_t eq;
    audio_eq_get(&eq);
    snprintf(reply, reply_len,
             "+OK eq=%s hp=%d bass=%+d treb=%+d punch=%d loud=%d\n",
             audio_eq_preset_name(eq.preset), eq.hp10 * 10,
             eq.bass_db, eq.treb_db, eq.punch, eq.loud);
}

static void handle_line(char *line, char *reply, size_t reply_len)
{
    reply[0] = '\0';

    char *argv[8];
    int argc = tokenize(line, argv, 8);
    if (argc == 0) return;

    str_upper(argv[0]);
    const char *cmd = argv[0];
    const char *a1  = (argc > 1) ? argv[1] : NULL;
    int32_t     n   = 0;

    if (!strcmp(cmd, "PING")) {
        snprintf(reply, reply_len, "+PONG %d LakeShark\n", FLIPPER_LINK_PROTO_VERSION);

