SAMS0N1TE/LakeShark/main/flipper_link.c
    } else if (!strcmp(cmd, "STAT")) {
        s_stat_now = true;
        snprintf(reply, reply_len, "+OK\n");

    } else if (!strcmp(cmd, "FREQ")) {
        uint32_t hz;
        if (!a1 || !parse_freq_hz(a1, &hz)) {
            snprintf(reply, reply_len, "-ERR freq\n");
        } else if (host_mode() == HOST_MODE_ADSB) {
            snprintf(reply, reply_len, "-ERR adsb is fixed at 1090 MHz\n");
        } else {
            /* Route by the active app: tuning P25 while the head is showing FM
             * silently did nothing, which looked like a dead link. */
            if (host_mode() == HOST_MODE_FM) lakeshark_fm_set_freq(hz);
            else                             lakeshark_p25_set_freq(hz);
            s_stat_now = true;
            snprintf(reply, reply_len, "+OK f=%lu\n", (unsigned long)hz);
        }

    } else if (!strcmp(cmd, "TUNE")) {
        if (!a1 || !parse_i32(a1, &n)) {
            snprintf(reply, reply_len, "-ERR tune\n");
        } else if (host_mode() == HOST_MODE_ADSB) {
            snprintf(reply, reply_len, "-ERR adsb is fixed at 1090 MHz\n");
        } else {
            uint32_t now;
            if (host_mode() == HOST_MODE_FM) {
                lakeshark_fm_tune((int)n);
                now = lakeshark_fm_get_freq();
            } else {
                lakeshark_p25_tune((int)n);
                now = lakeshark_p25_get_freq();
            }
            s_stat_now = true;
            snprintf(reply, reply_len, "+OK f=%lu\n", (unsigned long)now);
        }

    } else if (!strcmp(cmd, "FM")) {
        /* Sub-mode select; hops into FM the way the console `fm` command does. */
        static const char *names[] = { "listen", "scan", "pocsag", "wfm" };
        if (!a1) {
            snprintf(reply, reply_len, "+OK fm=%s\n", names[lakeshark_fm_get_mode() & 3]);
            return;
        }
        char up[16];
        strlcpy(up, a1, sizeof(up));
        for (char *p = up; *p; p++) *p = (char)tolower((unsigned char)*p);

        int m = -1;
        for (int i = 0; i < 4; i++) if (!strcmp(up, names[i])) { m = i; break; }
        if (m < 0 && !strcmp(up, "nbfm")) m = 0;
        if (m < 0 && parse_i32(a1, &n) && n >= 0 && n <= 3) m = (int)n;
        if (m < 0) { snprintf(reply, reply_len, "-ERR fm\n"); return; }

        if (host_mode() != HOST_MODE_FM && s_host.select_mode_by_name) {
            sdr_stall_reset();
            s_host.select_mode_by_name("fm");
        }
        lakeshark_fm_set_mode(m);
        s_stat_now = true;
        snprintf(reply, reply_len, "+OK fm=%s\n", names[m]);

    } else if (!strcmp(cmd, "SQL")) {
        if (!a1) {
            snprintf(reply, reply_len, "+OK sq=%d\n", lakeshark_fm_squelch_get());
        } else if (a1[0] == '+' || a1[0] == '-') {
            if (!parse_i32(a1, &n)) { snprintf(reply, reply_len, "-ERR sql\n"); return; }
            lakeshark_fm_squelch_delta((int)n);
            s_stat_now = true;
            snprintf(reply, reply_len, "+OK sq=%d\n", lakeshark_fm_squelch_get());
        } else if (parse_i32(a1, &n)) {
            lakeshark_fm_set_squelch((int)n);
            s_stat_now = true;
            snprintf(reply, reply_len, "+OK sq=%d\n", lakeshark_fm_squelch_get());
        } else {
            snprintf(reply, reply_len, "-ERR sql\n");
        }

    } else if (!strcmp(cmd, "BAUD")) {
        if (!a1) {
            snprintf(reply, reply_len, "+OK pb=%d\n", lakeshark_fm_get_baud());
        } else if (parse_i32(a1, &n)) {
            lakeshark_fm_set_baud((int)n);   /* 0 = auto, else 512/1200/2400 */
            s_stat_now = true;
            snprintf(reply, reply_len, "+OK pb=%d\n", lakeshark_fm_get_baud());
        } else {
            snprintf(reply, reply_len, "-ERR baud\n");
        }

    } else if (!strcmp(cmd, "SCAN")) {
        lakeshark_fm_scan_restart();
        s_stat_now = true;
        snprintf(reply, reply_len, "+OK\n");

    } else if (!strcmp(cmd, "PEAK")) {
        lakeshark_fm_tune_to_peak();
        s_stat_now = true;
        snprintf(reply, reply_len, "+OK f=%lu\n",
                 (unsigned long)lakeshark_fm_get_freq());

    } else if (!strcmp(cmd, "VOL")) {
        if (!a1) {
            snprintf(reply, reply_len, "+OK v=%d\n", audio_volume_get());
        } else if (a1[0] == '+' || a1[0] == '-') {
            if (!parse_i32(a1, &n)) { snprintf(reply, reply_len, "-ERR vol\n"); return; }
            audio_volume_delta((int)n);
            s_stat_now = true;
            snprintf(reply, reply_len, "+OK v=%d\n", audio_volume_get());
        } else if (parse_i32(a1, &n)) {
            if (n < 0) n = 0;
            if (n > 100) n = 100;
            audio_volume_set((int)n);
            s_stat_now = true;
            snprintf(reply, reply_len, "+OK v=%d\n", audio_volume_get());
        } else {
            snprintf(reply, reply_len, "-ERR vol\n");
        }

    } else if (!strcmp(cmd, "MUTE")) {
        if (!a1) {
            audio_toggle_mute();
        } else if (parse_i32(a1, &n)) {
            bool want = (n != 0);
            if (audio_is_muted() != want) audio_toggle_mute();
        } else {
            snprintf(reply, reply_len, "-ERR mute\n");
            return;
        }
        if (!audio_is_muted()) audio_out_ensure_unmuted();
        s_stat_now = true;
        snprintf(reply, reply_len, "+OK mu=%d\n", audio_is_muted() ? 1 : 0);

    } else if (!strcmp(cmd, "GAIN")) {
        if (!a1) {
            snprintf(reply, reply_len, "+OK g=%d\n", lakeshark_p25_gain_tenths());
            return;
        }
        char up[16];
        strlcpy(up, a1, sizeof(up));
        str_upper(up);
        if (!strcmp(up, "AUTO")) {
            lakeshark_p25_agc();
        } else if (!strcmp(up, "STEP")) {
            lakeshark_p25_gain_step();
        } else if (parse_i32(a1, &n)) {
            if (n < 0) n = 0;
            if (n > 496) n = 496;
            lakeshark_radio_set_gain((int)n);
        } else {
            snprintf(reply, reply_len, "-ERR gain\n");
            return;
        }
        s_stat_now = true;
        snprintf(reply, reply_len, "+OK g=%d\n", lakeshark_p25_gain_tenths());

    } else if (!strcmp(cmd, "DEMOD")) {
        if (!a1) {
            snprintf(reply, reply_len, "+OK dm=%d %s\n",
                     lakeshark_p25_mode_index(), lakeshark_p25_mode_name());
            return;
        }
        char up[16];
        strlcpy(up, a1, sizeof(up));
        str_upper(up);
        if (!strcmp(up, "CYCLE")) {
            lakeshark_p25_cycle_mode();
        } else if (parse_i32(a1, &n) && n >= 0 && n <= 3) {
            lakeshark_p25_set_mode((int)n);
        } else {
            snprintf(reply, reply_len, "-ERR demod\n");
            return;
        }
        s_stat_now = true;
        snprintf(reply, reply_len, "+OK dm=%d %s\n",
                 lakeshark_p25_mode_index(), lakeshark_p25_mode_name());

    } else if (!strcmp(cmd, "POL")) {
        lakeshark_p25_toggle_polarity();
        s_stat_now = true;
        snprintf(reply, reply_len, "+OK pol=%d\n",
                 lakeshark_p25_polarity_inverted() ? 1 : 0);

    } else if (!strcmp(cmd, "BEEP")) {
        /* "BEEP NOW" plays a tone immediately. Kept distinct from the 0/1 form
         * below, which only arms the P25 sync beep and makes no sound by
         * itself - so it can never answer "is the speaker actually working?". */
        if (a1 && !strcasecmp(a1, "NOW")) {
            if (!s_host.play_test_sound) {
                snprintf(reply, reply_len, "-ERR no test sound\n");
                return;
            }
            s_host.play_test_sound();
            snprintf(reply, reply_len, "+OK beep now\n");
            return;
        }
        if (!a1) {
            lakeshark_p25_beep_toggle();
        } else if (parse_i32(a1, &n)) {
            if (lakeshark_p25_beep_enabled() != (n != 0)) lakeshark_p25_beep_toggle();
        } else {
            snprintf(reply, reply_len, "-ERR beep\n");
            return;
        }
        s_stat_now = true;
        snprintf(reply, reply_len, "+OK bp=%d\n",
                 lakeshark_p25_beep_enabled() ? 1 : 0);

    } else if (!strcmp(cmd, "VGATE")) {
        if (!a1 || !parse_i32(a1, &n)) {
            snprintf(reply, reply_len, "-ERR vgate\n");
        } else {
            lakeshark_p25_set_voice_gate((int)n);
            s_stat_now = true;
            snprintf(reply, reply_len, "+OK vg=%d\n", lakeshark_p25_voice_gate());
        }

