SAMS0N1TE/LakeShark/main/flipper_link.c
    } else if (!strcmp(cmd, "RESET")) {
        lakeshark_p25_reset_stats();
        s_stat_now = true;
        snprintf(reply, reply_len, "+OK\n");

    } else if (!strcmp(cmd, "MODE")) {
        if (!a1) {
            snprintf(reply, reply_len, "+OK md=%s\n",
                     s_host.current_mode_name ? s_host.current_mode_name() : "?");
            return;
        }
        if (!s_host.select_mode_by_name) {
            snprintf(reply, reply_len, "-ERR nomode\n");
            return;
        }
        sdr_stall_reset();
        s_host.select_mode_by_name(a1);
        s_stat_now = true;
        snprintf(reply, reply_len, "+OK md=%s\n",
                 s_host.current_mode_name ? s_host.current_mode_name() : "?");

    /* ---- device management ------------------------------------------------
     *
     * The radio normally lives out of reach - on a battery, in another room,
     * with no console attached - so every recovery action that used to require
     * the USB-C port has a protocol equivalent here. All of them reply before
     * doing anything disruptive, so the head sees an acknowledgement rather
     * than a link that simply goes quiet.
     */
    } else if (!strcmp(cmd, "REBOOT")) {
        if (!s_host.reboot) {
            snprintf(reply, reply_len, "-ERR no reboot hook\n");
            return;
        }
        /* Answer first. The reply is written by the caller once we return, and
         * the hook defers the actual restart, so the head gets its +OK and can
         * show "rebooting" instead of "link lost". */
        snprintf(reply, reply_len, "+OK rebooting\n");
        s_host.reboot();

    } else if (!strcmp(cmd, "LOG")) {
        /* Same runtime log control as the console `log` command. Worth having
         * on the protocol because the situation where you most want to turn
         * logging up is the one where the radio is not on your desk - and
         * turning it DOWN remotely matters too, since a chatty tag costs the
         * radio real time on whatever task emits it. */
        if (!s_host.set_log_level) {
            snprintf(reply, reply_len, "-ERR no log hook\n");
            return;
        }
        const char *a2 = (argc > 2) ? argv[2] : NULL;
        const char *tag = a1 ? a1 : "*";
        const char *lvl = a2 ? a2 : a1;
        if (!lvl) { snprintf(reply, reply_len, "-ERR log <tag|*> <level>\n"); return; }
        if (!a2) tag = "*";
        if (s_host.set_log_level(tag, lvl)) {
            snprintf(reply, reply_len, "+OK log %s=%s\n", tag, lvl);
        } else {
            snprintf(reply, reply_len, "-ERR level (none|error|warn|info|debug|verbose)\n");
        }

    } else if (!strcmp(cmd, "SYS")) {
        if (!s_host.sys_info) {
            snprintf(reply, reply_len, "-ERR no sys hook\n");
            return;
        }
        char info[192];
        info[0] = '\0';
        s_host.sys_info(info, sizeof(info));
        sanitize(info);
        snprintf(reply, reply_len, "+OK %s\n", info);

    } else if (!strcmp(cmd, "C6")) {
        /* The ESP32-C6 carries the BLE controller. When BLE stops working the
         * co-processor is the first thing to bounce, and until now that meant
         * `c6 reset` on the console - unreachable exactly when BLE is the only
         * link you have. Over UART this is a genuine recovery path; over BLE it
         * will cut the link it arrived on, which is expected and worth doing
         * when the alternative is walking to the radio. */
        if (a1 && !strcasecmp(a1, "reset")) {
            if (!s_host.c6_reset) { snprintf(reply, reply_len, "-ERR no c6 hook\n"); return; }
            snprintf(reply, reply_len, "+OK c6 reset\n");
            s_host.c6_reset();
        } else if (a1 && !strcasecmp(a1, "up")) {
            if (!s_host.c6_up) { snprintf(reply, reply_len, "-ERR no c6 hook\n"); return; }
            int e = s_host.c6_up();
            snprintf(reply, reply_len, "+OK c6 up=%d\n", e);
        } else {
            snprintf(reply, reply_len, "-ERR c6 <reset|up>\n");
        }

    } else if (!strcmp(cmd, "SDR")) {
        if (a1 && !strcasecmp(a1, "reset")) {
            /* Soft restart: park and unpark the stream. Fixes the "rtl=0 bps=0
             * after a mode switch" case. Does NOT fix a dongle whose USB
             * connection dropped - for that see POWER below. */
            if (!s_host.sdr_reset) { snprintf(reply, reply_len, "-ERR no sdr hook\n"); return; }
            s_host.sdr_reset();
            s_stat_now = true;
            snprintf(reply, reply_len, "+OK sdr reset rtl=%d\n",
                     lakeshark_radio_device_ready() ? 1 : 0);
        } else if (a1 && !strcasecmp(a1, "recover")) {
            /* The in-place recovery the LCD build already had and headless
             * never wired up: app_request_recover() exits the app, calls
             * rtlsdr_dev_reopen() - a real USB device reopen, which is the step
             * park/unpark cannot do - and re-enters. Far cheaper than the power
             * cycle below, and it is what should be tried first. */
            if (!s_host.sdr_recover) {
                snprintf(reply, reply_len, "-ERR no sdr recover hook\n");
                return;
            }
            s_host.sdr_recover();
            snprintf(reply, reply_len, "+OK sdr recovering\n");

        } else if (a1 && !strcasecmp(a1, "power")) {
            /* Cut the dongle's VBUS and bring it back, forcing a full USB
             * re-enumeration. This is the one recovery that works when the
             * connection has been physically disturbed: the dongle keeps its
             * own state across an SoC reset, so REBOOT does not clear it and
             * only a power cycle does - which until now meant unplugging the
             * board. Takes a few seconds and drops the RF stream while it
             * happens, so it is a deliberate action, never automatic. */
            if (!s_host.sdr_power_cycle) {
                snprintf(reply, reply_len, "-ERR no sdr power hook\n");
                return;
            }
            snprintf(reply, reply_len, "+OK sdr power cycling\n");
            s_host.sdr_power_cycle();
        } else {
            snprintf(reply, reply_len, "+OK rtl=%d stl=%d\n",
                     lakeshark_radio_device_ready() ? 1 : 0, sdr_stall_s());
        }

