SAMS0N1TE/LakeShark/main/flipper_link.c
    } else if (!strcmp(cmd, "BLE")) {
        /* Radio-side BLE. The handoff's sequencing rule is "bring the P4's BLE
         * down before switching the head into BLE mode" - which was impossible
         * from the head. Over UART it now is, which makes the documented safe
         * switch a thing the head can perform on its own. */
        if (!s_host.ble_enable) {
            snprintf(reply, reply_len, "-ERR no ble hook\n");
            return;
        }
        if (a1 && !strcasecmp(a1, "off")) {
            s_host.ble_enable(false);
            snprintf(reply, reply_len, "+OK ble off\n");
        } else if (a1 && !strcasecmp(a1, "on")) {
            s_host.ble_enable(true);
            snprintf(reply, reply_len, "+OK ble on\n");
        } else {
            snprintf(reply, reply_len, "-ERR ble <on|off>\n");
        }

    } else if (!strcmp(cmd, "TEL")) {
        if (!a1 || !parse_i32(a1, &n)) {
            snprintf(reply, reply_len, "+OK tel=%d\n", s_cfg.telemetry_hz);
        } else {
            if (n < 0)  n = 0;
            if (n > 20) n = 20;
            s_cfg.telemetry_hz = (int)n;
            snprintf(reply, reply_len, "+OK tel=%d\n", s_cfg.telemetry_hz);
        }

    } else if (!strcmp(cmd, "EQ")) {
        audio_eq_cfg_t eq;
        audio_eq_get(&eq);

        if (!a1) {
            eq_reply(reply, reply_len);
            return;
        }

        char up[16];
        strlcpy(up, a1, sizeof(up));
        str_upper(up);

        const char *a2 = (argc > 2) ? argv[2] : NULL;
        bool is_field = strcmp(up, "BASS") == 0 || strcmp(up, "TREB") == 0 ||
                        strcmp(up, "HP")   == 0 || strcmp(up, "PUNCH") == 0 ||
                        strcmp(up, "LOUD") == 0;
        bool need_val = is_field && a2 != NULL;

        if (!need_val) {
            int p = audio_eq_preset_from_name(a1);
            if (p < 0 && parse_i32(a1, &n) &&
                n >= 0 && n < AUDIO_EQ_PRESET_COUNT) p = (int)n;
            if (p < 0) { snprintf(reply, reply_len, "-ERR eq\n"); return; }
            audio_eq_apply_preset(p);
            s_stat_now = true;
            eq_reply(reply, reply_len);
            return;
        }

        if (!a2 || !parse_i32(a2, &n)) { snprintf(reply, reply_len, "-ERR eq\n"); return; }

        if (!strcmp(up, "HP")) {
            int hz = (n > 0 && n < AUDIO_EQ_HP_MIN) ? (int)n * 10 : (int)n;
            eq.hp10 = (uint8_t)(hz <= 0 ? 0 : (hz + 5) / 10);
        } else if (!strcmp(up, "BASS")) {
            eq.bass_db = (int8_t)n;
        } else if (!strcmp(up, "TREB")) {
            eq.treb_db = (int8_t)n;
        } else if (!strcmp(up, "PUNCH")) {
            eq.punch = (uint8_t)(n < 0 ? 0 : (n > 100 ? 100 : n));
        } else {
            eq.loud = (uint8_t)(n < 0 ? 0 : (n > AUDIO_EQ_LOUD_MAX ? AUDIO_EQ_LOUD_MAX : n));
        }
        eq.preset = AUDIO_EQ_CUSTOM;
        audio_eq_set(&eq);
        s_stat_now = true;
        eq_reply(reply, reply_len);

    } else if (!strcmp(cmd, "TEST")) {
        if (!a1) {
            snprintf(reply, reply_len, "+OK test=%s busy=%d\n",
                     "sweep|bass|noise|tone|chirp|moto", snd_test_busy() ? 1 : 0);
            return;
        }
        int w = snd_test_from_name(a1);
        if (w < 0 && parse_i32(a1, &n) && n >= 0 && n < SND_TEST_COUNT) w = (int)n;
        if (w < 0) { snprintf(reply, reply_len, "-ERR test\n"); return; }

        audio_out_ensure_unmuted();
        if (!snd_test_start(w)) {
            snprintf(reply, reply_len, "-ERR test busy\n");
            return;
        }
        snprintf(reply, reply_len, "+OK test=%s\n", snd_test_name(w));

    } else {
        s_bad_lines++;
        snprintf(reply, reply_len, "-ERR unknown %s\n", cmd);
    }
}

int flipper_link_snapshot(char *buf, size_t len)
{
    return build_telemetry(buf, len);
}

/* Header GPIOs that are free on the ESP32-P4-NANO. Deliberately excludes the
 * UART0 console (37/38), the I2C/I2S/codec block (7-13, 53), the USB1P1 pins
 * (24-27) and the boot strap (35). GPIO32/33 are in the list now that the P25
 * diag UART has released them. */
static const int SCAN_PINS[] = {
    33, 32, 45, 47, 48, 0, 1, 2, 3, 6, 4, 5, 20, 21, 22, 23, 36,
};
#define N_SCAN_PINS ((int)(sizeof(SCAN_PINS) / sizeof(SCAN_PINS[0])))

/* Two pins on the header are actually control lines and must never be swept:
 *
 *   GPIO46 - USB-host VBUS enable. Reconfiguring it, especially with a
 *            pull-down, browns out the RTL-SDR.
 *   GPIO54 - ESP32-C6 reset/enable (CONFIG_ESP_HOSTED_SDIO_GPIO_RESET_SLAVE).
 *            Floating it even briefly can reset the Wi-Fi/BT co-processor and
 *            tear down the ESP-Hosted link.
 *
 * Both are absent from SCAN_PINS; these guards cover the probe path too, and
 * the case where someone points the link at one of them by hand. */
#define VBUS_EN_GPIO 46
#define C6_EN_GPIO   54

/* Measured on a P4-NANO with nothing attached to the headers and the head's app
 * closed: these three read 100% high against the internal pull-down, so the
 * board has its own pull-ups on them. They are not evidence of a wire, and the
 * probe must not report them as one. Re-measure if the board revision changes:
 * `link probe` with every jumper off gives the baseline directly. */
static const int IDLE_HIGH_PINS[] = { 32, 36 };

static bool pin_idles_high(int pin)
{
    for (size_t i = 0; i < sizeof(IDLE_HIGH_PINS) / sizeof(IDLE_HIGH_PINS[0]); i++) {
        if (IDLE_HIGH_PINS[i] == pin) return true;
    }
    return false;
}

int flipper_link_scan_rx(int dwell_ms)
{
    if (dwell_ms < 200)  dwell_ms = 200;
    if (dwell_ms > 5000) dwell_ms = 5000;

    flipper_link_cfg_t saved = s_cfg;
    bool was_running = s_run;
    if (was_running) flipper_link_stop();

    /* Park TX on a pin nothing else uses so the scan cannot drive the very
     * line it is listening to. */
    s_cfg.tx_gpio = -1;
    esp_err_t err = link_install();
    if (err != ESP_OK) {
        printf("scan: uart install failed: %s\n", esp_err_to_name(err));
        s_cfg = saved;
        if (was_running) flipper_link_start(&s_cfg, NULL);
        return -1;
    }

    printf("scanning %d pins, %d ms each (drive the head so it keeps talking)\n",
           N_SCAN_PINS, dwell_ms);

    int best = -1;
    size_t best_n = 0;
    for (int i = 0; i < N_SCAN_PINS; i++) {
        int pin = SCAN_PINS[i];
        /* uart_set_pin puts a pull-up on RX, so an unconnected pin idles high
         * and yields zero bytes rather than noise. */
        if (uart_set_pin(s_cfg.uart_num, UART_PIN_NO_CHANGE, pin,
                         UART_PIN_NO_CHANGE, UART_PIN_NO_CHANGE) != ESP_OK) {
            printf("  GPIO%-2d : (cannot route)\n", pin);
            continue;
        }
        uart_flush_input(s_cfg.uart_num);
        vTaskDelay(pdMS_TO_TICKS(dwell_ms));

        size_t avail = 0;
        uart_get_buffered_data_len(s_cfg.uart_num, &avail);

        char peek[33] = { 0 };
        if (avail) {
            int n = uart_read_bytes(s_cfg.uart_num, (uint8_t *)peek,
                                    avail > 32 ? 32 : avail, 0);
            for (int k = 0; k < n; k++) {
                if (peek[k] < 32 || peek[k] > 126) peek[k] = '.';
            }
            peek[n > 0 ? n : 0] = '\0';
        }
        printf("  GPIO%-2d : %4u bytes  %s\n", pin, (unsigned)avail, peek);

        if (avail > best_n) { best_n = avail; best = pin; }
        uart_flush_input(s_cfg.uart_num);
    }

    link_uninstall();
    s_cfg = saved;
    if (was_running) flipper_link_start(&s_cfg, NULL);

    if (best >= 0) printf("scan: busiest pin GPIO%d (%u bytes)\n", best, (unsigned)best_n);
    else           printf("scan: nothing heard on any pin\n");
    return best;
}

