SAMS0N1TE/LakeShark/main/flipper_link.c
fail:
    uart_driver_delete(s_cfg.uart_num);
    return err;
}

static void link_uninstall(void)
{
    if (!s_installed) return;
    s_installed = false;
    uart_driver_delete(s_cfg.uart_num);

    if (s_cfg.tx_gpio < 0) return;

    /* Hand TX back as a plain output driven high, which is a UART line's idle
     * state, so the head never sees a spurious start bit while we are down.
     * (This also keeps the old GPIO46 default safe: that pin is the USB-host
     * VBUS enable, and releasing it low would brown out the dongle.) */
    gpio_config_t out = {
        .pin_bit_mask = 1ULL << s_cfg.tx_gpio,
        .mode         = GPIO_MODE_OUTPUT,
        .pull_up_en   = GPIO_PULLUP_DISABLE,
        .pull_down_en = GPIO_PULLDOWN_DISABLE,
        .intr_type    = GPIO_INTR_DISABLE,
    };
    gpio_config(&out);
    gpio_set_level(s_cfg.tx_gpio, 1);
}

/* If we have been talking for a while and the head has never answered, its TX
 * wire may simply be on a different header pin than configured. Sweep for it
 * and adopt whatever is actually clocking bytes in. Costs ~12 s of telemetry
 * downtime, but only ever runs when nothing is listening anyway. */
static void heal_task(void *arg)
{
    (void)arg;
    for (;;) {
        vTaskDelay(pdMS_TO_TICKS(60000));
        if (!s_run || s_rx_lines > 0) continue;
        if (s_tx_lines < 50) continue;   /* not really transmitting yet */

        ESP_LOGW(TAG, "no RX after %lu TX frames - sweeping header pins for the head",
                 (unsigned long)s_tx_lines);
        int pin = flipper_link_scan_rx(700);
        if (pin >= 0 && pin != s_cfg.rx_gpio) {
            flipper_link_cfg_t c = s_cfg;
            c.rx_gpio = pin;
            ESP_LOGW(TAG, "adopting GPIO%d as link RX", pin);
            flipper_link_reconfigure(&c);
        }
    }
}

esp_err_t flipper_link_start(const flipper_link_cfg_t *cfg,
                             const flipper_link_host_t *host)
{
    if (s_run) return ESP_ERR_INVALID_STATE;
    if (cfg)  s_cfg  = *cfg;
    if (host) s_host = *host;

    esp_err_t err = link_install();
    if (err != ESP_OK) {
        ESP_LOGE(TAG, "uart install failed: %s", esp_err_to_name(err));
        return err;
    }

    s_run = true;
    /* 6 KB, not 4. link_task holds line[192] + reply[256] + tel[512] + rx[128]
     * before it calls anything, and the telemetry builders below it nest
     * snprintf over a mode-specific snapshot. 4 KB overflowed outright once the
     * ADS-B snapshot grew, and the failure mode is a stack-protection panic
     * that only appears in one mode - worth paying for headroom here. */
    if (xTaskCreate(link_task, "fliplink", 6144, NULL, 5, &s_task) != pdPASS) {
        s_run = false;
        link_uninstall();
        return ESP_ERR_NO_MEM;
    }

    static bool healer_started = false;
    if (!healer_started) {
        healer_started = (xTaskCreate(heal_task, "fl_heal", 4096, NULL, 3, NULL) == pdPASS);
    }

    /* Announce ourselves so a head that is already listening latches on
     * without having to poll. */
    char hello[64];
    int  len = snprintf(hello, sizeof(hello), "+HELLO %d LakeShark\n",
                        FLIPPER_LINK_PROTO_VERSION);
    link_write(hello, len);
    return ESP_OK;
}

void flipper_link_stop(void)
{
    if (!s_run) return;
    s_run = false;
    for (int i = 0; i < 50 && s_task; i++) vTaskDelay(pdMS_TO_TICKS(10));
    link_uninstall();
}

bool flipper_link_running(void) { return s_run; }

esp_err_t flipper_link_reconfigure(const flipper_link_cfg_t *cfg)
{
    bool was = s_run;
    if (was) flipper_link_stop();
    if (cfg) s_cfg = *cfg;
    if (!was) return ESP_OK;
    return flipper_link_start(&s_cfg, NULL);
}

void flipper_link_get_cfg(flipper_link_cfg_t *out) { if (out) *out = s_cfg; }

int flipper_link_sdr_stall_s(void) { return sdr_stall_s(); }

void flipper_link_set_verbose(bool en) { s_verbose = en; }
bool flipper_link_verbose(void)        { return s_verbose; }

void flipper_link_stats(uint32_t *rx_lines, uint32_t *tx_lines, uint32_t *bad_lines)
{
    if (rx_lines)  *rx_lines  = s_rx_lines;
    if (tx_lines)  *tx_lines  = s_tx_lines;
    if (bad_lines) *bad_lines = s_bad_lines;
}
